ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gatt_client.h
/*******************************************************************************
* \file cy_ble_stack_gatt_client.h
* \version 2.0
*
* \brief
*  This file contains declarations of public BLE APIs of Generic Attribute Profile - Client Role.
*  Also specifies the defines, constants, and data structures required for the APIs.
* 
* Related Document:
*  BLE Standard Spec - CoreV4.2, CSS, CSAs, ESR05, ESR06
* 
********************************************************************************
* \copyright
* Copyright 2014-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#ifndef CY_BLE_STACK_GATT_CLIENT_H_
#define CY_BLE_STACK_GATT_CLIENT_H_


/***************************************
* Common stack includes
***************************************/

#include "cy_ble_stack_gatt.h"

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/***************************************
** Exported data structures
***************************************/
/**
 \addtogroup group_ble_common_api_gatt_definitions
 @{
*/

/** Stop command parameter */
typedef struct
{
    /**Connection handle*/
    cy_stc_ble_conn_handle_t     connHandle; 
    
}cy_stc_ble_gattc_stop_cmd_param_t;

/** GATT Discover primary service request parameter */
typedef struct
{
    /** Handle Range */
    cy_stc_ble_gatt_attr_handle_range_t      range;     

    /**Connection handle*/
    cy_stc_ble_conn_handle_t                 connHandle; 
    
}cy_stc_ble_gattc_read_by_group_req_t;

/** GATT Discover primary service by UUID request parameter */
typedef struct
{
    /** Attribute Value to Find */
    cy_stc_ble_gatt_value_t                   value; 

    /** Handle Range - Start and End Handle */
    cy_stc_ble_gatt_attr_handle_range_t         range;  

    /** 16-bit UUID to Find */
    cy_ble_uuid16_t                           uuid; 
    
    /**Connection handle*/
    cy_stc_ble_conn_handle_t                 connHandle; 

}cy_stc_ble_gattc_find_by_type_value_req_t;

/** GATT read by type request parameter */
typedef struct
{
    /** Handle Range */
    cy_stc_ble_gatt_attr_handle_range_t      range;     

    /** GATT UUID type */
    cy_ble_uuid_t                            uuid;   

   /** Format indicating, 16-bit or 128-bit UUIDs
       * For 16-bit UUID format - CY_BLE_GATT_16_BIT_UUID_FORMAT (0x01)
       * For 128-bit UUID format - CY_BLE_GATT_128_BIT_UUID_FORMAT (0x02)
    */
    uint8_t                                 uuidFormat;   
    
    /**Connection handle*/
    cy_stc_ble_conn_handle_t                 connHandle; 
    
}cy_stc_ble_gattc_read_by_type_req_t;

/** GATT find info request parameter */
typedef cy_stc_ble_gattc_read_by_group_req_t cy_stc_ble_gattc_find_info_req_t;

/** Read request parameter */
typedef struct
{
    /** Handle on which Read Blob is requested */
    cy_ble_gatt_db_attr_handle_t        attrHandle;    

    /**Connection handle*/
    cy_stc_ble_conn_handle_t             connHandle; 
    
}cy_stc_ble_gattc_read_req_t;

/** Handle-offset pair parameter */
typedef struct
{
    /** Handle on which Read Blob is requested */
    cy_ble_gatt_db_attr_handle_t        attrHandle;    

    /** Value Offset from which the Read is Requested */
    uint16_t                             offset;    
    
}cy_stc_ble_gattc_handle_offset_pair_t;

/** Read blob request parameter */
typedef struct
{
    /** Handle-offset pair parameter */
    cy_stc_ble_gattc_handle_offset_pair_t    handleOffset;    
    
    /**Connection handle*/
    cy_stc_ble_conn_handle_t                 connHandle; 
    
}cy_stc_ble_gattc_read_blob_req_t;

/** GATT handle list type */
typedef struct
{
    /** Handle list where the UUID with value Indicated is found */
    uint16_t    * handleList;

    /** Number of Handles in the list */
    uint16_t    listCount;

    /** Actual Number of Handles Packed. This is a output parameter */
    uint16_t    actualCount;

}cy_stc_ble_gattc_handle_list_t;

/** Read multiple request parameter */
typedef struct
{
    /** GATT handle list type */
    cy_stc_ble_gattc_handle_list_t  handleListType;
    
    /**Connection handle*/
    cy_stc_ble_conn_handle_t        connHandle; 

}cy_stc_ble_gattc_read_mult_req_t;

/** Write request parameter */
typedef cy_stc_ble_gatt_write_param_t  cy_stc_ble_gattc_write_req_t;

/** Prepare Write request parameter */
typedef cy_stc_ble_gatt_prep_write_param_t  cy_stc_ble_gattc_prep_write_req_t;

/** Prepare Write request parameter for reliable write request */
typedef struct
{
    /** handle value offset pair */
    cy_stc_ble_gatt_handle_value_offset_param_t  * handleValOffsetPair; 

    /** Connection handle */
    cy_stc_ble_conn_handle_t                     connHandle;  
    
    /** Number of requests. That is, the count of array of structures 
             of type 'cy_stc_ble_gatt_handle_value_offset_param_t'. Each array element 
             represents a value and the attribute to which the value has 
             to be written */
    uint8_t                                   numOfRequests;
    
}cy_stc_ble_gattc_reliable_write_req_t;

/** Execute Write request parameter */
typedef struct
{
    /** Connection handle */
    cy_stc_ble_conn_handle_t     connHandle;             

    /** Indicates whether Queued Write is to be executed (0x01) or canceled (0x00) */
    uint8_t                   flag;
    
}cy_stc_ble_gattc_exec_write_req_t;

/** Write command request to be sent to Server */
typedef cy_stc_ble_gattc_write_req_t  cy_stc_ble_gattc_write_cmd_req_t;

/** Signed Write command request to be sent to Server */
typedef cy_stc_ble_gattc_write_req_t  cy_stc_ble_gattc_signed_write_cmd_req_t;

/** Signed Write command request to be sent to Server */
typedef cy_stc_ble_gattc_stop_cmd_param_t  cy_stc_ble_gattc_confirmation_req_t;

/* --------------------------Structure corresponding to events-------------------- */

