ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gatt_client.h
/** Read response parameter type received from server*/
typedef struct
{
    /** Attribute Value  */
    cy_stc_ble_gatt_value_t      value;     

    /** Connection handle */
    cy_stc_ble_conn_handle_t     connHandle; 
    
}cy_stc_ble_gattc_read_rsp_param_t;

/** Handle value notification data received from server */
typedef cy_stc_ble_gattc_write_req_t  cy_stc_ble_gattc_handle_value_ntf_param_t;

/** GATT handle value indication parameter received from server type */
typedef cy_stc_ble_gattc_write_req_t  cy_stc_ble_gattc_handle_value_ind_param_t;

/** Data Element for Group Response */
typedef struct
{
    /** attribute handle value pair */
    uint8_t       * attrValue;

    /** Length of each Attribute Data Element including the Handle Range */
    uint16_t      length;

    /** Total Length of Attribute Data */
    uint16_t      attrLen;
}cy_stc_ble_gattc_grp_attr_data_list_t;

/** Read By Group Response received from Server*/
typedef struct
{
    /** Group attribute data list */
    cy_stc_ble_gattc_grp_attr_data_list_t   attrData;

    /** Connection handle */
    cy_stc_ble_conn_handle_t                connHandle; 
    
}cy_stc_ble_gattc_read_by_grp_rsp_param_t;

/** GATT read by type response received from server*/
typedef cy_stc_ble_gattc_read_by_grp_rsp_param_t cy_stc_ble_gattc_read_by_type_rsp_param_t;

/** GATT find by type value response received from server*/
typedef struct
{
    /** Handle Range list */
    cy_stc_ble_gatt_attr_handle_range_t        * range; 

     /** Size of list */
    uint8_t                                  count;  

    /** Connection handle */
    cy_stc_ble_conn_handle_t                 connHandle; 
     
}cy_stc_ble_gattc_find_by_type_rsp_param_t;

/** GATT list of Handle UUID pair parameter type */
typedef struct
{
    /** Handle - UUID Pair list
       This is a packed byte stream, hence it needs to be unpacked and decoded. */
    uint8_t      *list;     

    /** Number of elements in the list in bytes */
    uint16_t  byteCount;
    
}cy_stc_ble_gattc_handle_uuid_list_param_t;

/** GATT find info response received from Server*/
typedef struct
{    
    /** Handle Value list */    
    cy_stc_ble_gattc_handle_uuid_list_param_t       handleValueList;  

    /** Connection handle */
    cy_stc_ble_conn_handle_t                     connHandle;

    /** Format indicating, 16-bit (0x01) or 128-bit (0x02) UUIDs */    
    uint8_t                                   uuidFormat;         
    
}cy_stc_ble_gattc_find_info_rsp_param_t;

/** Execute Write result */
typedef struct
{
    /**Connection handle*/
    cy_stc_ble_conn_handle_t             connHandle; 
    
    /** Result of the execute write request */
    uint8_t                             result;       

}cy_stc_ble_gattc_exec_write_rsp_param_t;

/** Long procedure end indication event parameter */
typedef struct
{
    /**Connection handle*/
    cy_stc_ble_conn_handle_t             connHandle; 
    
    /** Result of the execute write request */
    uint8_t                             opcode;       

}cy_stc_ble_gattc_long_procedure_end_param_t;

/** Execute Write response parameter */
typedef cy_stc_ble_gattc_exec_write_req_t  cy_stc_ble_gattc_exec_write_rsp_t;
/** @} */
/***************************************
** Exported APIs
***************************************/
/**
 \addtogroup group_ble_common_api_gatt_client_functions
 @{
*/

/******************************************************************************
* Function Name: Cy_BLE_GATTC_StopCmd
***************************************************************************//**
* 
*  This function is used by the GATT Client to stop any of the following ongoing 
*  GATT procedures:
*   1.  Cy_BLE_GATTC_DiscoverPrimaryServices()
*   2.  Cy_BLE_GATTC_DiscoverPrimaryServiceByUuid()
*   3.  Cy_BLE_GATTC_FindIncludedServices()
*   4.  Cy_BLE_GATTC_DiscoverCharacteristics()
*   5.  Cy_BLE_GATTC_DiscoverCharacteristicByUuid()
*   6.  Cy_BLE_GATTC_DiscoverCharacteristicDescriptors()
*   7.  Cy_BLE_GATTC_ReadLongCharacteristicValues()
*   8.  Cy_BLE_GATTC_WriteLongCharacteristicValues()
*   9.  Cy_BLE_GATTC_ReliableWrites()
*   10. Cy_BLE_GATTC_ReadLongCharacteristicDescriptors()
*   11. Cy_BLE_GATTC_WriteLongCharacteristicDescriptors()
*   12. Cy_BLE_GATTC_ReadByTypeReq()
*   .
*  If none of the above procedures is ongoing, then this command will be ignored.
*  This function has no effect on ATT procedures other than those listed above.
*  
*  If the user intends to start a new GATT procedure including those listed above
*  and there is an ongoing GATT procedure (any one from the above list), the user
*  needs to call this function to stop the ongoing GATT procedure and then invoke
*  the desired GATT procedure.
*  This is not a blocking function. Successful operation is informed through event 
*  'CY_BLE_EVT_GATTC_STOP_CMD_COMPLETE' if procedure is not already ended.
* 
*  \param param: parameter is of type cy_stc_ble_gattc_stop_cmd_param_t.
*   param->connHandle: Connection handle to identify the peer GATT entity of type
*              cy_stc_ble_conn_handle_t.
*
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Error codes                           | Description
*  ------------                          | -----------
*  CY_BLE_SUCCESS                        | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER        | If 'param' is NULL or 'connHandle' is invalid.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTC_StopCmd
(
    cy_stc_ble_gattc_stop_cmd_param_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GATTC_ExchangeMtuReq
***************************************************************************//**
* 
*  This function is used by the GATT Client to send Maximum Transmitted Unit
*  (GATT MTU) supported by the GATT Client. This is a non-blocking function.
* 
*  Default GATT MTU size as per Bluetooth 4.1 core specification is 23 bytes. If
*  the GATT Client supports a size greater than the default, it has to invoke
*  this function with the desired GATT MTU size. This function should be
*  initiated only once during a connection.
* 
*  Refer to  Bluetooth 4.1 core specification, Volume 3, Part G, section 4.3.1
*  for more details on GATT MTU exchange operation.
* 
*  This function call results in CY_BLE_EVT_GATTS_XCNHG_MTU_REQ event at the
*  GATT Server's end in response to which the GATT Server is expected to send
*  its GATT MTU size.
* 
*  The CY_BLE_EVT_GATTC_XCHNG_MTU_RSP event is generated at the
*  GATT Client's end on receiving GATT MTU response from the GATT Server.
* 
*  \param param: parameter is of type CY_BLE_GATT_XCHG_MTU_REQ_PARAM_T.
*   param->mtu: Size of GATT MTU. Max GATT MTU supported by BLE stack is 512 Bytes.
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Error codes                          | Description
*  ------------                         | -----------
*  CY_BLE_SUCCESS                       | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER       | If 'param' is NULL or 'connHandle' is invalid or, 'mtu' value is greater than that set on calling Cy_BLE_StackInit().
*  CY_BLE_ERROR_INVALID_OPERATION       | This operation is not permitted.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED| Memory allocation failed.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTC_ExchangeMtuReq
(
    cy_stc_ble_gatt_xchg_mtu_param_t  * param
);


