ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gatt_client.h
/******************************************************************************
* Function Name: Cy_BLE_GATTC_DiscoverPrimaryServices
***************************************************************************//**
* 
* This function is used by the GATT Client to discover the primary services as 
* per the range provided on a GATT Server to which it is connected. 
* This is a non-blocking function.
*
* Internally, this function initiates multiple Read By Group Type Requests to
* the peer device in response to which it receives Read By Group Type Responses.
* Each Read By Group Type Response results in 
* CY_BLE_EVT_GATTC_READ_BY_GROUP_TYPE_RSP event, which is propagated to the 
* application layer for handling.
*
* Primary service discovery is complete when Error Response 
* (CY_BLE_EVT_GATTC_ERROR_RSP) is received and the Error Code is set to Attribute
* Not Found or when the End Group Handle in the Read by Group Type Response is
* 0xFFFF. Completion of this operation is notified to the upper layer(s) using
* CY_BLE_EVT_GATTC_ERROR_RSP with error code updated appropriately or with 
* CY_BLE_EVT_GATTC_LONG_PROCEDURE_END event
*
* It is permitted to end the above stated sequence of operations early if the
* desired primary service is found prior to discovering all the primary services
* on the GATT Server. This can be achieved by calling the Cy_BLE_GATTC_StopCmd() 
* function.
*
* Refer to Bluetooth 4.1 core specification, Volume 3, Part G, section 4.4.1 for
* more details on this sequence of operations.
*
*  \param param: parameter is of type cy_stc_ble_gattc_read_by_group_req_t.
*   param->connHandle: Connection handle to identify the peer GATT entity of type
*              cy_stc_ble_conn_handle_t.
*   param->range: Parameter is of type cy_stc_ble_gatt_attr_handle_range_t where,
*        1. 'range.startHandle' can be set to the start handle of the desired
*            primary service.
*        2. 'range.endHandle' can be set to the end handle of the desired 
*            primary service.
*   \note
*   'startHandle' & 'endHandle' should not be zero and 'startHandle' shall be less than or equal to the 'endHandle'.
*
* \return
* cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
* failed. Following are the possible error codes.
*
*  Error codes                          | Description
*  ------------                         | -----------
*  CY_BLE_SUCCESS                       | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER       | If 'param' is NULL or if any of the input parameters are invalid.
*  CY_BLE_ERROR_INVALID_OPERATION       | This operation is not permitted.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED| Memory allocation failed.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTC_DiscoverPrimaryServices
(
    cy_stc_ble_gattc_read_by_group_req_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GATTC_DiscoverPrimaryServiceByUuid
***************************************************************************//**
* 
*  This function is used by the GATT Client to discover a specific primary
*  service on a GATT Server, to which it is connected, when only the Service
*  UUID is known. 
*  This is a non-blocking function.
* 
*  Internally, this function initiates multiple Find By Type Value Requests with
*  the Attribute Type parameter set to the UUID for Primary Service and the
*  Attribute Value set to the 16-bit Bluetooth UUID or 128-bit UUID for the
*  specific primary service. Each Find By Type Value Response received from the
*  peer device is passed to the application as 
*  CY_BLE_EVT_GATTC_FIND_BY_TYPE_VALUE_RSP event.
* 
*  The sequence of operations is complete when the Error Response is received
*  and the Error Code is set to Attribute Not Found or when the End Group 
*  Handle in the Find By Type Value Response is 0xFFFF. Completion of this 
*  function is notified to the upper layer using the CY_BLE_EVT_GATTC_ERROR_RSP event
*  with the error code updated appropriately or with the CY_BLE_EVT_GATTC_LONG_PROCEDURE_END
*  event.
* 
*  It is permitted to end the function early by calling the Cy_BLE_GATTC_StopCmd()
*  function if a desired primary service is found prior to discovery of all the
*  primary services of the specified service UUID supported on the GATT Server.
* 
*  Refer to Bluetooth 4.1 core specification, Volume 3, Part G, section 4.4.2 
*  for more details on this sequence of operations.
*     
*  \param param: parameter is of type cy_stc_ble_gattc_find_by_type_value_req_t.
*   param->connHandle: Connection handle to identify the peer GATT entity of type 
*               cy_stc_ble_conn_handle_t.
*   param->range and param->uuid are ignored in this API.
*   param->value: Parameter is of type cy_stc_ble_gatt_value_t, where,
*          1. 'value.val' should point to uint8_t array containing the UUID to 
*              look for. UUID can be 16 or 128 bit.
*          2. 'value.len' should be set to 2 if the 16-bit UUID is to be found.
*              The length should be set to 16 if 128-bit UUID is to be found.
*          3. 'value.actualLen' is an unused parameter and should be ignored 
*              as it is unused.
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Error codes                          | Description
*  ------------                         | -----------
*  CY_BLE_SUCCESS                       | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER       | If 'param' is NULL or 'connHandle' is invalid.
*  CY_BLE_ERROR_INVALID_OPERATION       | This operation is not permitted.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED| Memory allocation failed.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTC_DiscoverPrimaryServiceByUuid
(
    cy_stc_ble_gattc_find_by_type_value_req_t  * param
);


