ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gatt_client.h
/******************************************************************************
* Function Name: Cy_BLE_GATTC_FindIncludedServices
***************************************************************************//**
* 
*  This function is used by the GATT Client to find Included Service
*  declarations within a GATT Service to which it is connected. This is a 
*  non-blocking function.
* 
*  Internally, multiple Read By Type Requests are sent to the peer device in
*  response to which Read By Type Responses are received 
*  (CY_BLE_EVT_GATTC_READ_BY_TYPE_RSP) and passed to the application layer.
* 
*  When Read By Type Response data does not contain the service UUID,
*  indicating the service UUID is a 128-bit UUID, the application layer can
*  choose to get the service UUID by performing the following steps:
*  1. Stop ongoing GATT operation by invoking Cy_BLE_GATTC_StopCmd()
*  2. Send Read Request by invoking the function 
*      Cy_BLE_GATTC_ReadCharacteristicValue() with the read request handle set to
*      the attribute handle of the included service. Handle associated events. 
*  3. Re-initiate Cy_BLE_GATTC_FindIncludedServices function, setting the start
*      handle to the attribute handle that is placed next to the one used in
*      the above step.
* 
*  The function may end early if a desired included service is
*  found prior to discovering all the included services of the specified
*  service supported on the server by calling the Cy_BLE_GATTC_StopCmd() 
*  function. If the Cy_BLE_GATTC_StopCmd() function is not invoked, completion of
*  this function is notified to the upper layer using CY_BLE_EVT_GATTC_ERROR_RSP 
*  or the CY_BLE_EVT_GATTC_LONG_PROCEDURE_END event.
* 
*  Refer to Bluetooth 4.1 core specification, Volume 3, Part G, section 4.5.1 
*  for more details on the sequence of operations.
* 
*  \param param: Pointer to a variable of type cy_stc_ble_gattc_read_by_type_req_t,
*                     Where, the following needs to be set:
*                     param->range.startHandle
*                     param->range.endHandle
*                                 param->connHandle  
*                                 Where, the following needs to be ignored:
*                     param->uuidFormat (CY_BLE_GATT_16_BIT_UUID_FORMAT or
*                                                     CY_BLE_GATT_128_BIT_UUID_FORMAT)
*                     param->uuid.uuid16 or readByTypeReqParam->uuid.uuid128 
*                     based on the uuidFormat
*  \note
*   'startHandle' & 'endHandle' should not be zero, and 'startHandle' shall be less than or equal to the 'endHandle'.
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Error codes                          | Description
*  ------------                         | -----------
*  CY_BLE_SUCCESS                       | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER       | If 'param' is NULL or if any of the input parameters are invalid.
*  CY_BLE_ERROR_INVALID_OPERATION       | This operation is not permitted.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED| Memory allocation failed.
*     
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTC_FindIncludedServices
(
    cy_stc_ble_gattc_read_by_type_req_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GATTC_ReadByTypeReq
***************************************************************************//**
* 
*  This function allows the user to send Read by type request to peer server
* 
*  Refer to Bluetooth 4.1 core specification, Volume 3, Part G, section 4.5.1 
*  for more details on the sequence of operations.
* 
*  \param param: Pointer to a variable of type cy_stc_ble_gattc_read_by_type_req_t,
*                     Where, the following needs to be set:
*                     param->range.startHandle
*                     param->range.endHandle
*                                 param->connHandle  
*                     param->uuidFormat (CY_BLE_GATT_16_BIT_UUID_FORMAT or
*                                                     CY_BLE_GATT_128_BIT_UUID_FORMAT)
*                     param->uuid.uuid16 or readByTypeReqParam->uuid.uuid128 
*                     based on the uuidFormat
* 
*  \note
*   'startHandle' & 'endHandle' should not be zero, and 'startHandle' shall be less than or equal to the 'endHandle'.
*
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Error codes                          | Description
*  ------------                         | -----------
*  CY_BLE_SUCCESS                       | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER       | If 'param' is NULL or if any of the input parameters are invalid.
*  CY_BLE_ERROR_INVALID_OPERATION       | This operation is not permitted.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED| Memory allocation failed.
*     
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTC_ReadByTypeReq
(
    cy_stc_ble_gattc_read_by_type_req_t      * param
);


/******************************************************************************
* Function Name: Cy_BLE_GATTC_ReadCharacteristicValue
***************************************************************************//**
* 
*  This function reads a Characteristic Value from a GATT Server when the GATT
*  Client knows the Characteristic Value Handle. This is a non-blocking function.
* 
*  Internally, Read Request is sent to the peer device in response to which Read
*  Response is received. This response results in CY_BLE_EVT_GATTC_READ_RSP event
*  which is propagated to the application for handling the event data. An Error
*  Response (CY_BLE_EVT_GATTC_ERROR_RSP event at the GATT Client's end) is sent
*  by the GATT Server in response to the Read Request on insufficient 
*  authentication or insufficient authorization or insufficient encryption key
*  size is caused by the GATT Client, or if a read operation is not permitted on
*  the Characteristic Value. The Error Code parameter is set as specified in
*  the Attribute Protocol.
*  Execution of this API generates CY_BLE_EVT_GATTS_READ_CHAR_VAL_ACCESS_REQ event 
*  at GATT server's end if the corresponding characteristic's attribute permission is set 
*  to CY_BLE_GATT_DB_ATTR_CHAR_VAL_RD_EVENT.
* 
*  Refer to Bluetooth 4.1 core specification, Volume 3, Part G, section 4.8.1
*  for more details on the sequence of operations.
* 
*  \param param: Pointer to a variable of type cy_stc_ble_gattc_read_req_t.
*                     Where, the following needs to be set:
*                     param->attrHandle: Attribute handle to be read
*                                 param->connHandle  
*
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Error codes                          | Description
*  ------------                         | -----------
*  CY_BLE_SUCCESS                       | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER       | If 'param' is NULL or 'connHandle' is invalid, or if 'attrHandle' is zero. 
*  CY_BLE_ERROR_INVALID_OPERATION       | This operation is not permitted.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED| Memory allocation failed.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTC_ReadCharacteristicValue
(
    cy_stc_ble_gattc_read_req_t  * param
); 


