ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gatt_client.h
/******************************************************************************
* Function Name: Cy_BLE_GATTC_ReadMultipleCharacteristicValues
***************************************************************************//**
* 
*  This function reads multiple Characteristic Values from a GATT Server when
*  the GATT Client knows the Characteristic Value Handles. This is a 
*  non-blocking function.
* 
*  Internally, Read Multiple Request is sent to the peer device in response to
*  which Read Multiple Response is received. This results in the 
*  CY_BLE_EVT_GATTC_READ_MULTI_RSP event, which is propagated to the application
*  layer.
* 
*  An Error Response event is sent by the server (CY_BLE_EVT_GATTC_ERROR_RSP) in
*  response to the Read Multiple Request if insufficient authentication, 
*  insufficient authorization, or insufficient encryption key size is used by the
*  client, or if a read operation is not permitted on any of the Characteristic
*  Values. The Error Code parameter is set as specified in the Attribute
*  Protocol.
*
*  Execution of this API generates CY_BLE_EVT_GATTS_READ_CHAR_VAL_ACCESS_REQ event 
*  at the GATT server's end if corresponding characteristic's attribute permission is set to
*  CY_BLE_GATT_DB_ATTR_CHAR_VAL_RD_EVENT.
* 
*  Refer to Bluetooth 4.1 core specification, Volume 3, Part G, section 4.8.4
*  for more details on the sequence of operations.
* 
*  \param param: Pointer to a variable of type cy_stc_ble_gattc_read_mult_req_t.
*                     Where, the following needs to be set:
*                     param->handleList
*                     param->listCount
*                                 param->connHandle  
*
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Error codes                          | Description
*  ------------                         | -----------
*  CY_BLE_SUCCESS                       | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER       | If 'param' is NULL or if any of the input parameters are invalid.
*  CY_BLE_ERROR_INVALID_OPERATION       | This operation is not permitted.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED| Memory allocation failed.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTC_ReadMultipleCharacteristicValues
(
    cy_stc_ble_gattc_read_mult_req_t            * param
);


/******************************************************************************
* Function Name: Cy_BLE_GATTC_ReadCharacteristicDescriptors
***************************************************************************//**
* 
*  This function reads a characteristic descriptor from a GATT Server when the
*  GATT Client knows the Attribute handle from the characteristic descriptor
*  declaration. This is a non-blocking function.
* 
*  Internally, Read Request is sent to the peer device in response to which
*  Read Response is received. This response results in CY_BLE_EVT_GATTC_READ_RSP
*  event, which is propagated to the application for handling the event data.
* 
*  An Error Response (the CY_BLE_EVT_GATTC_ERROR_RSP event at the GATT Client's end) 
*  is sent by the GATT Server in response to the Read Request on insufficient
*  authentication or insufficient authorization or insufficient encryption
*  key size is caused by the GATT Client, or if a read operation is not
*  permitted on the Characteristic Value. The Error Code parameter is set as
*  specified in the Attribute Protocol.
*
* 
*  Execution of this API generates CY_BLE_EVT_GATTS_READ_CHAR_VAL_ACCESS_REQ event 
*  at GATT server's end if corresponding attribute's permission has set to
*  CY_BLE_GATT_DB_ATTR_CHAR_VAL_RD_EVENT.
*
*  Refer to Bluetooth 4.1 core specification, Volume 3, Part G, section 4.12.1
*  for more details on the sequence of operations.
* 
*  \param param: Pointer to a variable of type cy_stc_ble_gattc_read_req_t.
*                     Where, the following needs to be set:
*                     param->attrHandle: Attribute handle to be read
*                                 param->connHandle  
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Error codes                          | Description
*  ------------                         | -----------
*  CY_BLE_SUCCESS                       | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER       | If 'param' is NULL or 'connHandle' is invalid, or if 'attrHandle' is zero.
*  CY_BLE_ERROR_INVALID_OPERATION       | This operation is not permitted.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED| Memory allocation failed.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTC_ReadCharacteristicDescriptors
(
    cy_stc_ble_gattc_read_req_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GATTC_ReadLongCharacteristicDescriptors
***************************************************************************//**
* 
*  This function reads a characteristic descriptor from a GATT Server when the
*  GATT Client knows the Attribute handle from the characteristic descriptor
*  declaration and the length of the characteristic descriptor declaration is
*  longer than what can be sent in a single Read Response Attribute Protocol
*  message. This is a non-blocking function.
* 
*  Internally multiple Read Blob Requests are sent to the peer device in response
*  to which Read Blob Responses are received. For each Read Blob Request, a Read
*  Blob Response event is received (CY_BLE_EVT_GATTC_READ_BLOB_RSP) with a portion
*  of the Characteristic Value contained in the Part Attribute Value parameter.
*  These events are propagated to the application layer for further processing.
*  Each read blob response will return up to (GATT MTU-1) bytes of data. If the size of 
*  characteristic descriptor field is an integral multiple of (GATT MTU-1) then the 
*  operation terminates with an error response event, where the error code is
*  CY_BLE_GATT_ERR_INVALID_OFFSET. If the size of the characteristic descriptor
*  field is not an integral multiple of (GATT MTU-1), the last read blob response will
*  return data bytes that are less than (GATT MTU-1). The application must monitor 
*  these two conditions before proceeding with the initiation of any other GATT
*  operation.
* 
*  An Error Response event (CY_BLE_EVT_GATTC_ERROR_RSP) is sent by the GATT Server
*  in response to the Read Blob Request if insufficient authentication,
*  insufficient authorization, or insufficient encryption key size is used by the
*  client, or if a read operation is not permitted on the Characteristic Value.
*  The Error Code parameter is set as specified in the Attribute Protocol. If
*  the Characteristic Value is not longer than (GATT MTU - 1) an Error Response with
*  the Error Code set to Attribute Not Long is received by the GATT Client on
*  the first Read Blob Request.
*  
*  Execution of this API generates CY_BLE_EVT_GATTS_READ_CHAR_VAL_ACCESS_REQ event 
*  at the GATT server's end if the corresponding attribute's permission has set to
*  CY_BLE_GATT_DB_ATTR_CHAR_VAL_RD_EVENT.
* 
*  Refer to Bluetooth 4.1 core specification,
*  Volume 3, Part G, section 4.12.2 for more details on the sequence of operations.
* 
*  \param param: Pointer to a variable of type cy_stc_ble_gattc_read_blob_req_t.
*                     Where, the following needs to be set:
*                     param->attrHandle
*                     param->offset
*                                 param->connHandle  
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Error codes                          | Description
*  ------------                         | -----------
*  CY_BLE_SUCCESS                       | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER       | If 'param' is NULL or 'connHandle' is invalid, or if 'attrHandle' is zero. 
*  CY_BLE_ERROR_INVALID_OPERATION       | This operation is not permitted.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED| Memory allocation failed.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTC_ReadLongCharacteristicDescriptors
(
    cy_stc_ble_gattc_read_blob_req_t  * param
);


