ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gatt_client.h
/******************************************************************************
* Function Name: Cy_BLE_GATTC_WriteCharacteristicValue
***************************************************************************//**
* 
*  This function writes a Characteristic Value to a GATT Server when the GATT
*  Client knows the Characteristic Value Handle. This is a non-blocking function.
* 
*  Internally, Write Request is sent to the GATT Server in response to which
*  Write Response is received. This results in the event
*  CY_BLE_EVT_GATTC_WRITE_RSP, which indicates that the write operation succeeded.
* 
*  An Error Response event (CY_BLE_EVT_GATTC_ERROR_RSP) is sent by the server in
*  response to the Write Request if insufficient authentication, insufficient
*  authorization, or insufficient encryption key size is used by the client, or if
*  a write operation is not permitted on the Characteristic Value. The Error 
*  Code parameter is set as specified in the Attribute Protocol.
* 
*  Refer to Bluetooth 4.1 core specification, Volume 3, Part G, section
*  4.9.3 for more details on the sequence of operations.
*
*  \param param: Pointer to a variable of type cy_stc_ble_gattc_write_req_t.
*                     Where, the following needs to be set:
*                     param->handleValPair
*                                 param->connHandle  
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Error codes                          | Description
*  ------------                         | -----------
*  CY_BLE_SUCCESS                       | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER       | If 'param' is NULL or 'connHandle' is invalid, or if 'attrHandle' is zero or if 'param->handleValPair.value.len' value is greater than (Effective GATT MTU-3).
*  CY_BLE_ERROR_INVALID_OPERATION       | This operation is not permitted.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED| Memory allocation failed.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTC_WriteCharacteristicValue
(
    cy_stc_ble_gattc_write_req_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GATTC_WriteCharacteristicDescriptors
***************************************************************************//**
* 
*  This function writes a characteristic descriptor value to a GATT Server
*  when the GATT Client knows the characteristic descriptor handle. This is a
*  non-blocking function.
* 
*  Internally, Write Request is sent to the GATT Server in response to which
*  Write Response is received. This results in the event 
*  CY_BLE_EVT_GATTC_WRITE_RSP, which indicates that the write operation succeeded.
* 
*  An Error Response event (CY_BLE_EVT_GATTC_ERROR_RSP) is sent by the server in
*  response to the Write Request if insufficient authentication, insufficient 
*  authorization, or insufficient encryption key size is used by the client, or if
*  a write operation is not permitted on the Characteristic Value. The Error 
*  Code parameter is set as specified in the Attribute Protocol.
* 
*  Refer to Bluetooth 4.1 core specification, Volume 3, Part G, section 4.12.3
*  for more details on the sequence of operations.
* 
*  \param param: Pointer to a variable of type cy_stc_ble_gattc_write_req_t.
*                     Where, the following needs to be set:
*                     param->handleValPair
*                                 param->connHandle  
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Error codes                          | Description
*  ------------                         | -----------
*  CY_BLE_SUCCESS                       | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER       | If 'param' is NULL or 'connHandle' is invalid, or if 'attrHandle' is zero or if 'param->handleValPair.value.len' value is greater than (Effective GATT MTU-3).
*  CY_BLE_ERROR_INVALID_OPERATION       | This operation is not permitted.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED| Memory allocation failed.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTC_WriteCharacteristicDescriptors
(
    cy_stc_ble_gattc_write_req_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GATTC_WriteLongCharacteristicValues
***************************************************************************//**
* 
*  This function writes a Characteristic Value to a GATT Server when the GATT
*  Client knows the Characteristic Value Handle but the length of the
*  Characteristic Value is longer than GATT MTU size and cannot be sent in a single
*  Write Request Attribute Protocol message. This is a non-blocking function.
* 
*  Internally, multiple Prepare Write Requests are sent to the GATT Server using
*  the CY_BLE_EVT_GATTS_PREP_WRITE_REQ event, in response to which Prepare Write Responses 
*  are received. No events are generated by the BLE Stack during these operations.
* 
*  Prepare Write Requests are repeated until the complete Characteristic Value
*  has been transferred to the GATT Server, after which an Execute Write Request
*  is sent to the GATT Server to write the initially transferred value at the
*  GATT Server's end. This generates CY_BLE_EVT_GATTS_EXEC_WRITE_REQ at the GATT
*  Server's end.
* 
*  Once the GATT Server responds, CY_BLE_EVT_GATTC_EXEC_WRITE_RSP event
*  is generated at the GATT Client's end. The value associated with this event
*  has to be checked by the application layer to confirm that the long write
*  operation succeeded.
* 
*  An Error Response event CY_BLE_EVT_GATTC_ERROR_RSP is
*  received by the GATT Client in response to the Prepare Write Request if
*  insufficient authentication, insufficient authorization, or insufficient
*  encryption key size is used by the client, or if a write operation is not
*  permitted on the Characteristic Value. The Error Code parameter is set as
*  specified in the Attribute Protocol.
*  
*  Execution of this API generates CY_BLE_EVT_MEMORY_REQUEST event for request
*  CY_BLE_PREPARED_WRITE_REQUEST at GATT server's end. GATT server application has to
*  allocate memory of type cy_stc_ble_prepare_write_request_memory_t and set configMemory 
*  in this event parameter to allocated memory.
*     
* 
*  Refer to Bluetooth 4.1 core specification, Volume 3, Part G, section 4.9.4
*  for more details on the sequence of operations.
*  
*  \param param: Pointer to a variable of type cy_stc_ble_gattc_prep_write_req_t,
*                      where 'param->value.val' points to the actual
*                      data to be written. 'param' and all associated
*                      variables need to be retained in memory by the calling
*                      application until the GATT Write Long Characteristic Value
*                      operation is completed successfully.
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Error codes                          | Description
*  ------------                         | -----------
*  CY_BLE_SUCCESS                       | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER       | If 'param' is NULL or 'connHandle' is invalid, or if 'attrHandle' is zero.
*  CY_BLE_ERROR_INVALID_OPERATION       | This operation is not permitted.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED| Memory allocation failed.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTC_WriteLongCharacteristicValues
(
    cy_stc_ble_gattc_prep_write_req_t  * param
);


