ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gatt_client.h
/******************************************************************************
* Function Name: Cy_BLE_GATTC_ReliableWrites
***************************************************************************//**
* 
*  This function writes a Characteristic Value to a GATT Server when the GATT
*  Client knows the Characteristic Value Handle, and assurance is required
*  that the correct Characteristic Value is going to be written by transferring
*  the Characteristic Value to be written in both directions before the write
*  is performed. This is a non-blocking function.
* 
*  Internally, multiple Prepare Write Requests are sent to the GATT Server using 
*  CY_BLE_EVT_GATTS_PREP_WRITE_REQ event, in response to which Prepare Write Responses 
*  are received. No events are generated by the BLE Stack during these operations.
* 
*  Prepare Write Requests are repeated until the complete Characteristic Value
*  has been transferred to the GATT Server, after which an Execute Write Request
*  is sent to the GATT Server to write the initially transferred value at the
*  GATT Server's end. This generates CY_BLE_EVT_GATTS_EXEC_WRITE_REQ at the GATT
*  Server's end.
* 
*  Once the GATT Server responds, a CY_BLE_EVT_GATTC_EXEC_WRITE_RSP event is
*  generated at the GATT Client's end. The value associated with this event has 
*  to be checked by the application layer to confirm that the long write 
*  operation succeeded. An Error Response event CY_BLE_EVT_GATTC_ERROR_RSP is 
*  received by the GATT Client in response to the Prepare Write Request if 
*  insufficient authentication, insufficient authorization, insufficient 
*  encryption key size is used by the client, or if a write operation is not 
*  permitted on the Characteristic Value. The Error Code parameter is set as 
*  specified in the Attribute Protocol.
*  
*  Execution of this API generates the CY_BLE_EVT_MEMORY_REQUEST event for request
*  CY_BLE_PREPARED_WRITE_REQUEST at the GATT server's end. The GATT server application must
*  allocate memory of type cy_stc_ble_prepare_write_request_memory_t and set configMemory 
*  in this event parameter to allocated memory.
* 
*  Refer to Bluetooth 4.1 core specification, Volume 3, Part G, section 4.9.5
*  for more details on the sequence of operations.
* 
*  \param param: Pointer to a variable of type cy_stc_ble_gattc_reliable_write_req_t.
*                      Since more than one writes are performed  'param' and 
*                      all associated variables need to be retained in memory by
*                      the calling application until the GATT Reliable Write 
*                      operation is completed successfully.
*  param->handleValOffsetPair: array of type 'cy_stc_ble_gatt_handle_value_offset_param_t', which 
*                                           contains the values to be written, has to be specified.
*  param->numOfRequests: Number of requests. That is, the count of array of structures 
*                  of type cy_stc_ble_gatt_handle_value_offset_param_t. Each array element 
*                  represents a value and the attribute to which the value has 
*                  to be written.
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Error codes                          | Description
*  ------------                         | -----------
*  CY_BLE_SUCCESS                       | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER       | If 'param' or 'handleValOffsetPair' is NULL or 'connHandle' is invalid, or if 'numOfRequests' is zero.
*  CY_BLE_ERROR_INVALID_OPERATION       | This operation is not permitted.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED| Memory allocation failed.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTC_ReliableWrites
(
    cy_stc_ble_gattc_reliable_write_req_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GATTC_WriteLongCharacteristicDescriptors
***************************************************************************//**
* 
*  This function writes a characteristic descriptor value to a GATT Server
*  when the GATT Client knows the characteristic descriptor handle but the
*  length of the characteristic descriptor value is longer than what can be
*  sent in a single Write Request Attribute Protocol message. This is a
*  non-blocking function.
* 
*  Internally, multiple Prepare Write Requests are sent
*  to the GATT Server using CY_BLE_EVT_GATTS_PREP_WRITE_REQ event, in response to 
*  which Prepare Write Responses are received. No events are generated by the 
*  BLE Stack during these operations.
* 
*  Prepare Write Requests are repeated until the complete Characteristic
*  Descriptor Value has been transferred to the GATT Server, after which an
*  Execute Write Request is sent to the GATT Server to write the initially
*  transferred value at the GATT Server's end. This generates
*  CY_BLE_EVT_GATTS_EXEC_WRITE_REQ at the GATT Server's end.
* 
*  Once the GATT Server responds, the CY_BLE_EVT_GATTC_EXEC_WRITE_RSP event is
*  generated at the GATT Client's end. The value associated with this event must
*  be checked by the application layer to confirm that the long write operation
*  succeeded.
* 
*  An Error Response event CY_BLE_EVT_GATTC_ERROR_RSP is received by the GATT
*  Client in response to the Prepare Write Request if insufficient
*  authentication, insufficient authorization, or insufficient encryption key
*  size is used by the client, or if a write operation is not permitted on the
*  Characteristic Value. The Error Code parameter is set as specified in the
*  Attribute Protocol.
*
*  Execution of this API generates CY_BLE_EVT_MEMORY_REQUEST event for request
*  CY_BLE_PREPARED_WRITE_REQUEST at GATT server's end. GATT server application must
*  allocate memory of type cy_stc_ble_prepare_write_request_memory_t and set configMemory 
*  in this event parameter to allocated memory.
* 
*  Refer to Bluetooth 4.1 core specification, Volume 3,
*  Part G, section 4.12.4 for more details on the sequence of operations.
* 
*  \param param: Pointer to a variable of type cy_stc_ble_gattc_prep_write_req_t,
*                      where 'param->value.val' points to the actual
*                      data to be written. 'param' and all associated
*                      variables must be retained in memory by the calling
*                      application until the GATT Write Long Characteristic Value
*                      operation is completed successfully.
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Error codes                          | Description
*  ------------                         | -----------
*  CY_BLE_SUCCESS                       | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER       | If 'param' is NULL or 'connHandle' is invalid, or if 'attrHandle' is zero. 
*  CY_BLE_ERROR_INVALID_OPERATION       | This operation is not permitted.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED| Memory allocation failed.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTC_WriteLongCharacteristicDescriptors
(
    cy_stc_ble_gattc_prep_write_req_t  * param
);


