ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gatt_client.h
/******************************************************************************
* Function Name: Cy_BLE_GATTC_SendExecuteWriteReq
***************************************************************************//**
* 
*  This function allows the user to send execute write request to remote server.
*  This function should be called if client has previously initiated long/reliable 
*  write operation and remote has send error response. Based on error response 
*  application may choose to execute all pending requests or cancel the request.
* 
*  \param param: Pointer to a variable of type cy_stc_ble_gattc_exec_write_req_t.
*   param->connHandle: Connection handle to identify the peer GATT entity of type 
*               cy_stc_ble_conn_handle_t.
*   param->flag: Indicates whether Queued Write is to be executed (0x01) or canceled (0x00)
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Error codes                          | Description
*  ------------                         | -----------
*  CY_BLE_SUCCESS                       | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER       | If 'param' is NULL or 'connHandle' is invalid.
*  CY_BLE_ERROR_INVALID_OPERATION       | This operation is not permitted.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED| Memory allocation failed.
*     
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTC_SendExecuteWriteReq
(
    cy_stc_ble_gattc_exec_write_req_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GATTC_WriteWithoutResponse
***************************************************************************//**
* 
*  This function writes a Characteristic Value to a GATT Server when the GATT
*  Client knows the Characteristic Value Handle and the client does not need an
*  acknowledgment that the write was successfully performed. This is a blocking
*  function. No event is generated on calling this function.
* 
*  Internally, Write Command is sent to the GATT Server and nothing is
*  received in response from the GATT Server.
* 
*  Refer to Bluetooth 4.1 core specification, Volume 3, Part G, section 4.9.1
*  for more details on the sequence of operations.
*
*  On the server side CY_BLE_EVT_GATTS_WRITE_CMD_REQ event is sent to application
*  to indicate GATT Write Without Response request is received from client.
* 
*  \param param: Pointer to a variable of type cy_stc_ble_gattc_write_req_t.
*                     Where, the following needs to be set:
*                     param->handleValPair
*                                 param->connHandle  
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Error codes                          | Description
*  ------------                         | -----------
*  CY_BLE_SUCCESS                       | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER       | If 'param' is NULL or 'connHandle' is invalid, or if 'attrHandle' is zero or if 'param->handleValPair.value.len' value is greater than (Effective GATT MTU-3).
*  CY_BLE_ERROR_INVALID_OPERATION       | This operation is not permitted.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED| Memory allocation failed.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTC_WriteWithoutResponse
(
    cy_stc_ble_gattc_write_cmd_req_t  * param
);


/******************************************************************************
* Function Name: Cy_BLE_GATTC_SignedWriteWithoutRsp
***************************************************************************//**
* 
*  This function writes a Characteristic Value to a server when the client knows
*  the Characteristic Value Handle and the ATT Bearer is not encrypted. This 
*  procedure shall be used only if the Characteristic Properties
*  authenticated bit is enabled and the client and server device share a bond
*  as defined in Bluetooth Spec4.1 [Vol. 3] Part C, Generic Access Profile.
* 
*  This function only writes the first (GATT_MTU - 15) octets of an 
*  Attribute Value. This function cannot be used to write a long Attribute.
* 
*  Internally, Signed Write Command is used.
*  Refer to Bluetooth Spec 4.1 Security Manager [Vol. 3] Part H, Section 2.4.5.
* 
*  If the authenticated Characteristic Value that is written is the wrong size, 
*  has an invalid value as defined by the profile, or the signed value does not
*  authenticate the client, then the write shall not succeed and no error shall
*  be generated by the server.
*  
*  On the server side CY_BLE_EVT_GATTS_DATA_SIGNED_CMD_REQ event is sent to the application
*  to indicate the GATT Signed write cmd is received from the client.
* 
*  \param param: Pointer to a variable of type cy_stc_ble_gattc_write_req_t.
*                     Where, the following needs to be set:
*                     param->handleValPair
*                                 param->connHandle  
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Error codes                          | Description
*  ------------                         | -----------
*  CY_BLE_SUCCESS                       | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER       | If 'param' is NULL or if 'attrHandle' is zero.
*  CY_BLE_ERROR_NO_DEVICE_ENTITY        | 'connHandle.bdHandle' value does not represent any existing entry in the Stack.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED| Memory allocation failed.
*  CY_BLE_ERROR_INSUFFICIENT_RESOURCES  | Stack resources are unavailable.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTC_SignedWriteWithoutRsp
(
    cy_stc_ble_gattc_signed_write_cmd_req_t  * param
);


