ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gatt_client.h
/******************************************************************************
* Function Name: Cy_BLE_GATTC_Confirmation
***************************************************************************//**
* 
*  This function sends confirmation to the GATT Server on receiving Handle Value
*  Indication event CY_BLE_EVT_GATTC_HANDLE_VALUE_IND at the GATT Client's end.
*  This is a non-blocking function.
* 
*  This function call results in CY_BLE_EVT_GATTS_HANDLE_VALUE_CNF event at the
*  GATT Server's end.
* 
*  Refer to the Bluetooth 4.1 core specification, Volume 3, Part G, section 4.11.1
*  for more details on the sequence of operations.
*     
*  \param param: Pointer to a variable of type cy_stc_ble_gattc_confirmation_req_t.
*                     Where, the following needs to be set:
*                                 param->connHandle  
* 
* \return
*  cy_en_ble_api_result_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Error codes                          | Description
*  ------------                         | -----------
*  CY_BLE_SUCCESS                       | On successful operation.
*  CY_BLE_ERROR_INVALID_PARAMETER       | If 'param' is NULL or 'connHandle' is invalid.
*  CY_BLE_ERROR_INVALID_OPERATION       | This operation is not permitted.
*  CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED| Memory allocation failed.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTC_Confirmation
(
    cy_stc_ble_gattc_confirmation_req_t  * param
);

#ifdef __cplusplus
}
#endif /* __cplusplus */

/** @} */

#endif /* CY_BLE_STACK_GATT_CLIENT_H_ */

/* EOF */
